IDEA StatiCa Open Model
ReportSettings.ReportType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the type of report.
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReportType ReportType { get; set; }
Public Property ReportType As ReportType
	Get
	Set
public:
property ReportType ReportType {
	ReportType get ();
	void set (ReportType value);
}
Property Value
Type: ReportType
See Also
Reference
ReportSettings Class
IdeaRS.OpenModel.Connection Namespace